$(document).ready(function(e) {
    let testobj = {  
        "questions":[  
            {  
                "reply1":"Устав.",
                "reply4":"Образовательные концепции.",
                "subtheme":"Методика преподавания",
                "theme":"Методика преподавания",
                "reply5":"Учебный план.",
                "reply2":"Закон ”Об образовании”.",
                "correctly":"1",
                "question":"Свод правил, определяющие устройство и деятельность образовательных учреждении – это:",
                "reply3":"Конституция."
            },
            {  
                "subtheme":"Руководство Программы",
                "reply5":"Социально-ситуативном",
                "correctly":"4",
                "reply3":"Конструктивном",
                "theme":"Методика преподавания",
                "reply1":"Бихевиористическом",
                "reply2":"Когнитивном",
                "reply4":"Гуманистическом",
                "question":"Идея о том, что переход на более высокий уровень возможен только в случае удовлетворения потребностей более низкого порядка, отражена в подходе к обучению:"
            },
            {  
                "reply3":"Просьбы, стимулирование, добрые дела.",
                "correctly":"2",
                "question":"Наказание - это:",
                "theme":"Методика преподавания",
                "subtheme":"Методика преподавания",
                "reply2":"Способ воздействия на воспитанника с целью прекратить его отрицательные действия.",
                "reply1":"Метод воспитания, проявляющийся в форме требования.",
                "reply5":"Воздействие на знание учащихся с целью разъяснения фактов и явлений жизни..",
                "reply4":"Управление деятельностью ученика при помощи разнообразных повторяющихся дел."
            },
            {  
                "reply1":"Педагогического совета.",
                "reply5":"Органов самоуправления.",
                "subtheme":"Методика преподавания",
                "theme":"Методика преподавания",
                "reply3":"Методического совета.",
                "question":"Повышение методического уровня учителей – это функция:",
                "correctly":"3",
                "reply2":"Совета школы.",
                "reply4":"Родительский комитет.",
            },
            {  
                "reply2":"Личностный подход в воспитании.",
                "question":"Последовательное отношение педагога к воспитаннику как к личности, как к самостоятельному сознательному ответственному субъекту воспитательного взаимодействия - это:",
                "subtheme":"Методика преподавания",
                "correctly":"2",
                "reply3":"Дифференцированный подход в воспитании.",
                "reply5":"Деятельностный подход в воспитании.",
                "reply1":"Индивидуальный подход в воспитании.",
                "theme":"Методика преподавания",
                "reply4":"Комплексный подход в воспитании."
            },
            {  
                "reply5":"Побуждение, расширение, синтез",
                "reply3":"Апробирование, исправление, уточнение",
                "correctly":"1",
                "reply4":"Переориентация, мотивирование, поддержка",
                "reply2":"Мотивирование, осмысление, направление",
                "subtheme":"Руководство Программы",
                "reply1":"Побуждение, апробирование и переориентация",
                "theme":"Методика преподавания",
                "question":"Для поддержки обучения ученика какие техники постановки вопросов можно использовать?",
                "id_theme":"101"
            },
            {  
                "subtheme":"Дидактика",
                "theme":"Методика преподавания",
                "reply4":"обучение",
                "correctly":"2",
                "question":"Повторное осмысление материала, воспроизведение его на практике",
                "reply1":"понимание",
                "reply3":"осмысление",
                "reply5":"восприятие",
                "reply2":"закрепление"
            },
            {  
                "reply2":"Оценивание.",
                "question":"Метод формирования и закрепления необходимых качеств личности путем сравнения собственных результатов с достижениями других – это:",
                "reply1":"Стимулирование.",
                "reply5":"Контроль.",
                "correctly":"4",
                "subtheme":"Методика преподавания",
                "theme":"Методика преподавания",
                "reply4":"Соревнование.",
                "reply3":"Поощрение."
            },
            {  
                "reply2":"Научности и наглядности.",
                "reply5":"Прочности и доступности.",
                "theme":"Методика преподавания",
                "reply4":"Любознательности и комфортности.",
                "reply1":"Концентричности и линейности.",
                "reply3":"Систематичности и дружелюбности.",
                "subtheme":"Методика преподавания",
                "question":"Учебные программы строятся по принципу:",
                "correctly":"1"
            },
            {  
                "reply3":"Р. Г. Лемберг",
                "reply2":"Р. Қоянбаев",
                "subtheme":"Дидактика",
                "theme":"Методика преподавания",
                "question":"Первый доктор педагогических наук и академик Академии наук КазССР по специальности «Педагогика и психология» (1954 г.)",
                "reply1":"Т. Сабыров",
                "reply4":"Қ. Жарықбаев",
                "correctly":"2",
                "reply5":"Т. Тажибаев"
            },
            {  
                "reply2":"Гуманизация школы.",
                "question":"Коллегиальность управления школой – это принцип:",
                "subtheme":"Методика преподавания",
                "reply1":"Демократизации школы.",
                "correctly":"1",
                "reply3":"Гуманитаризация образования.",
                "reply5":"Руководства, уходящего в прошлое.",
                "theme":"Методика преподавания",
                "reply4":"Авторитарной школы."
            },
            {  
                "theme":"Методика преподавания",
                "reply4":"Демокрит.",
                "subtheme":"Методика преподавания",
                "question":"Автор метода отыскания истины путем постановки наводящих вопросов: ",
                "reply1":"Платон.",
                "reply5":"Гераклит.",
                "correctly":"3",
                "reply3":"Сократ.",
                "reply2":"Аристотель."
            },
            {  
                "theme":"Методика преподавания",
                "subtheme":"Методика преподавания",
                "correctly":"4",
                "reply3":"Принципы обучения.",
                "reply2":"Средства обучения.",
                "reply1":"Методы обучения.",
                "question":"Лекция, семинар, лабораторная работа, самостоятельная работа студентов - это:",
                "reply5":"Средства деятельности.",
                "reply4":"Формы организации обучения."
            },
            {  
                "reply1":"Интегрированного подхода",
                "subtheme":"Руководство Программы",
                "reply3":"Педагогики сотрудничества",
                "theme":"Методика преподавания",
                "reply5":"Теории развивающего обучения",
                "reply2":"Стратегии вмешательства",
                "reply4":"Концепции естественного развития",
                "question":"Предложение талантливым детям усложнённой программы обучения в классе и вне класса является характеристикой:",
                "correctly":"2",
            },
            {  
                "reply2":"Совокупность применяемых на нем методов обучения.",
                "reply1":"Совокупность всех его составных частей, внутренне связанных и взаимообусловленных.",
                "reply4":"Совокупность решаемых на нем дидактических задач, внутренне связанных и взаимообусловленных.",
                "subtheme":"Методика преподавания",
                "question":"Структура урока – это: ",
                "reply5":"Этапы урока.",
                "correctly":"3",
                "reply3":"Соотношение и последовательность проведения частей, моментов урока, способствующих выполнению учебных задач.",
                "theme":"Методика преподавания"
            },
            {  
                "reply2":"Шульман",
                "reply5":"Шолиер",
                "correctly":"2",
                "reply1":"Пажарес",
                "question":"Кто автор теории о «трех помощниках учителя»?",
                "subtheme":"Руководство Программы",
                "theme":"Методика преподавания",
                "reply3":"Хэтти",
                "reply4":"Барбер",
                "id_theme":"101"
            },
            {  
                "reply2":"Беседа используется для обмена знаниями, но участники терпимы к идеям других",
                "subtheme":"Руководство Программы",
                "reply4":"Идеи каждого расцениваются как полезные, но проходят тщательную оценку",
                "correctly":"4",
                "reply5":"Идеи повторяются и разрабатываются, но не оцениваются",
                "question":"Какое из приведённых высказываний характеризует исследовательский тип беседы:",
                "reply1":"Каждый принимает и соглашается с тем, что говорят другие",
                "reply3":"Каждый участник беседы приходит к своему решению",
                "theme":"Методика преподавания"
            },
            {  
                "reply5":"Законами.",
                "correctly":"2",
                "reply3":"Канонами.",
                "reply2":"Табу.",
                "subtheme":"Методика преподавания",
                "theme":"Методика преподавания",
                "reply4":"Заветами.",
                "question":"Система нравственных и религиозных запретов, нарушение которых, согласно суеверным представлениям, карается сверхъестественными силами, называется:",
                "reply1":"Нормами."
            },
            {  
                "subtheme":"Методика преподавания",
                "correctly":"1",
                "theme":"Методика преподавания",
                "reply4":"Метод проектов.",
                "reply5":"Неоцентризм.",
                "reply1":"Формальное образование.",
                "reply3":"Прагматизм.",
                "question":"Теория образования, провозглашающая необходимость развития способностей к анализу, синтезу, логическому мышлению – это:",
                "reply2":"Материальное образование.",
                "id_theme":"101"
            },
            {  
                "reply5":"Наиболее авторитетный педагог.",
                "reply2":"Заместитель директора по учебной работе.",
                "reply1":"Заместитель директора по воспитательной работе.",
                "reply4":"Председатель родительского комитета.",
                "subtheme":"Методика преподавания",
                "theme":"Методика преподавания",
                "correctly":"3",
                "question":"Председатель педагогического совета – это:",
                "reply3":"Директор школы.",
                "id_theme":"101"
            },
            {  
                "reply5":"Язык и другие системы символов имеет собственное происхождение",
                "reply3":"Когнитивное развитие – самостоятельное экспериментирование растущего ребёнка с физическим миром",
                "reply1":"Люди обладают множеством независимых «интеллектов»",
                "correctly":"3",
                "theme":"Методика преподавания",
                "reply4":"Социальная среда имеет огромное влияние на развитие растущего ребёнка",
                "subtheme":"Руководство Программы",
                "question":"Теории Жана Пиаже господствовали в мире когнитивной психологии в 1960-е гг. Какое из предлагаемых высказываний отражает теории Пиаже:",
                "reply2":"Человек обладает значительными врождёнными или легко выявляемыми когнитивными способностями"
            },
            {  
                "question":"Лидерство означает:",
                "reply5":"Умение брать инициативу по совершенствованию практики и принимать решения совместно с коллегами",
                "subtheme":"Руководство Программы",
                "theme":"Методика преподавания",
                "reply1":"Лидерство учителя заключается в усилении голоса",
                "correctly":"5",
                "reply3":"Анализ практики и выявление причин явлений",
                "reply4":"Довольствоваться имеющимися результатами",
                "reply2":"Постоянное развитие собственной практики учителя и распространение опыта"
            },
            {  
                "theme":"Методика преподавания",
                "subtheme":"Методика преподавания",
                "reply3":"Управление обучением, увеличение степени самостоятельности учащихся индивидуализация обучения.",
                "correctly":"3",
                "reply5":"Получение частей  обратной информации об уровне учебных возможностей ученика.",
                "reply4":"Упражнения с автоматизированной обратной связью.",
                "question":"Цель программированного обучения – это:",
                "reply1":"Решение воспитательных задач.",
                "reply2":"Жесткий контроль.",
            },
            {  
                "reply4":"Самоумение.",
                "reply5":"Самовнушение.",
                "theme":"Методика преподавания",
                "reply3":"Самовоспитание.",
                "question":"Сознательная деятельность человека, направляемая на развитие у себя каких-либо качеств,  это: ",
                "subtheme":"Методика преподавания",
                "correctly":"3",
                "reply1":"Воспитание.",
                "reply2":"Перевоспитание."
            },
            {  
                "correctly":"5",
                "reply3":"зона возможных отклонений",
                "theme":"Методика преподавания",
                "reply1":"главная цель и ожидаемый результат в развитии",
                "reply2":"очередной кризис в развитии",
                "question":"По Л. С. Выготскому, понятие «зона ближайщего развития» означает",
                "subtheme":"Педагогическая психология",
                "reply5":"психические функции, которые еще не созрели, но в процессе созревания",
                "reply4":"психические функции, которые уже сформированы у ребенка"
            },
            {  
                "reply1":"проведение экскурсий в музеи, выставочные залы",
                "subtheme":"Управление и организация учебного процесса ",
                "question":"К инновационной деятельности учителя относится",
                "reply5":"использование на уроках элементов игр",
                "reply3":"подготовка авторских программ и концепций развития школы",
                "correctly":"3",
                "reply4":"обеспечение методического оснащения учебно-воспитательного процесса",
                "reply2":"повышение квалификации",
                "theme":"Методика преподавания"
            },
            {  
                "theme":"Методика преподавания",
                "subtheme":"Методика преподавания",
                "reply3":"организационная",
                "correctly":"3",
                "reply5":"корректирующая.",
                "question":"Какая функция преподавания предмета отражает планирование урока:",
                "reply1":"конструктивная",
                "reply4":"информативная",
                "reply2":"гностическая"
            },
            {  
                "reply3":"Объяснительно-иллюстративный.",
                "reply4":"Наглядный метод.",
                "reply2":"Лабораторный метод.",
                "theme":"Методика преподавания",
                "correctly":"2",
                "reply1":"Репродуктивный метод.",
                "subtheme":"Методика преподавания",
                "reply5":"Метод самостоятельной работы.",
                "question":"Какой метод обучения используется если учащиеся под руководством учителя проделывают опыты или выполняют задания:"
            },
            {  
                "reply5":"Преподавание.",
                "reply4":"Познание.",
                "reply1":"Обучение.",
                "reply2":"Воспитание.",
                "theme":"Методика преподавания",
                "reply3":"Образование.",
                "correctly":"1",
                "question":"Процесс активного целенаправленного взаимодействия педагога и учащихся, в ходе которого формируются знания, умения, навыки, опыт деятельности и поведения, личностные качества – это:",
                "subtheme":"Методика преподавания"
            },
            {  
                "theme":"Методика преподавания",
                "reply5":"Форма обучения.",
                "subtheme":"Методика преподавания",
                "reply1":"Принцип обучения",
                "reply3":"Закон обучения.",
                "correctly":"4",
                "question":"Дискуссия, активизирующая познавательную деятельность обучаемого,  рассматривается как",
                "reply2":"Закономерности обучения.",
                "reply4":"Метод обучения."
            }
        ],
        "num_questions":30,
        "results":{  
            "101":{  
                "theme":"Методика преподавания",
                "quest_count":30,
                "score":0,
                "porog":15
            }
        },
        "test_type":"type-block",
        "remain_time":7200
    };

	let testobj2 = {"questions":[{"theme":"Методика преподавания","reply3":"графикалық, лабораториялық;","question":"Оқытудық көрнекілік әдістері:","reply1":"репродуктивті, түсіндірмелі-иллюстративті;","reply4":"иллюстрация, демонстрация,бақылау;","subtheme":"Педагогика","selected":"","reply2":"зерттеу, ішінара іздену;","correctly":"4","reply5":"практикалық.","id_theme":"101"},{"reply5":"сөйлеу,","reply2":"хабар лама;","id_theme":"101","reply4":"қарым-қатынас;","reply3":"танымдық;","question":"Оқушыны жан-жақты зерттеп тани білу қандай іскерлікке жатады:","subtheme":"Педагогика","theme":"Методика преподавания","correctly":"1","reply1":"зерттеушілік;","selected":""},{"correctly":"4","question":"Тест сөзі қай тіл ден енген :","reply4":"ағылшын;","selected":"","id_theme":"101","reply3":"орыс;","reply2":"грек;","reply1":"латын;","theme":"Методика преподавания","subtheme":"Педагогика","reply5":"араб."},{"id_theme":"101","reply5":"табиғат пен қоғам жайында ғылымда жинақталған білім жүйесін жеке адамның меңгеруін және оны өмірде тиімді етіп қолдана білуін айтады.","theme":"Методика преподавания","subtheme":"Педагогика","reply4":"сабақ өтетін жер мен уақытын, оқушы құрамын анықтайтын ұйымдастырылған процесс;","selected":"","reply3":"оқушыларды оқыту мен тәрбиелеу әрекеттерін қалыптастыруды ұйымдастыру;","correctly":"5","reply2":"мұғалім мен оқушының біріккен іс-әрекеті;","question":"Білім беру-педагогиканың негізгі категориясы ретінде:","reply1":"нақтылы тәрбие міндеттерін шешу мен жеке тұлғаны қалыптастыру мақсатына бағытталған, ұйымдастырылған процесс;"},{"theme":"Методика преподавания","reply5":"басты ереже.","reply2":"әдістердің жеке амалдары;","reply3":"мақсатқа жету жолы;","reply1":"іс-әрекеттің жеке бөлігі;","reply4":"ақиқатқа жету жолы;","selected":"","subtheme":"Педагогика","id_theme":"101","question":"Оқыту тәсілі:","correctly":"1"},{"reply1":"орта, мұрагерлік, тәрбие;","reply5":"тәрбие, қалыптасу, даму.","theme":"Методика преподавания","correctly":"2","question":"Педагогика ғылымының негізгі ұғымдары:","selected":"","id_theme":"101","reply3":"білім, тәрбие, дағды;","subtheme":"Педагогика","reply2":"тәрбие, оқыту, білім беру;","reply4":"оқыту,оқу, сабан бюеру;"},{"reply1":"алған білім негізінде оқушылардың практикалық әрекеті іске асырылады;","reply2":"адамзаттың жинақтаған тәжірибесі, заттар мен құбылыстарды,табиғат пен қоғам заңдарын тану  нәтижесі;","reply5":"оқыту нәтижелері.","selected":"","id_theme":"101","reply3":"қайта-қайта орындалатын практикалық әрекетке машықтану;","theme":"Методика преподавания","question":"Дағды:","subtheme":"Педагогика","reply4":"білім, іскерлік  пен дағдының бірлігі;","correctly":"3"},{"reply3":"4;","subtheme":"Педагогика","theme":"Методика преподавания","reply2":"3;","selected":"","correctly":"2","id_theme":"101","question":"Оқу бағдарламасы неше бөліктен тұрады:","reply5":"5;","reply4":"1;","reply1":"2;"},{"question":"Жеке адамның дамуына әсер ететін факторларды көрсет:","reply1":"оқыту мен білім беру;","reply2":"макроорта;","subtheme":"Педагогика","reply4":"тағдыр;","reply5":"орта, тәрбие, тұқымқуалаушылық,","reply3":"мінез-құлық;","correctly":"5","id_theme":"101","theme":"Методика преподавания","selected":""},{"reply1":"үйретуші, мұғалім,","selected":"","theme":"Методика преподавания","subtheme":"Педагогика","correctly":"5","reply4":"әдіс, тәсіл, құрал;","reply5":"бастапқы, негізгі, қағида.","reply3":"заңдылық, принцип;","question":"«Принцип»қандай мағынаны білдіреді:","id_theme":"101","reply2":"бастапқы, әдіс;"},{"reply3":"жаттығу, үйрету;","correctly":"2","theme":"Методика преподавания","id_theme":"101","reply1":"мадақтау, жазалау,жарыс;","selected":"","reply4":"тәрбиелеуші ситуация, мақтау;","subtheme":"Педагогика","reply2":"әңгіме, үлгі өнеге, қоғамдық пікір;","reply5":"өзін-өзі бақылау, аутотренинг.","question":"Сендіру әдістерінің қатарын көрсет:"},{"theme":"Методика преподавания","question":"Жеке адамның дамуына ықпал ететін негізгі фактор:","reply4":"тұқымқуалаушылық;","id_theme":"101","selected":"","subtheme":"Педагогика","reply2":"микроорта,","reply3":"тәрбие;","correctly":"3","reply1":"әлеуметтік орта;","reply5":"мезоорта."},{"question":"Сабақ:","reply2":"оқытуды ұйымдастырудың жалпы формасы;","selected":"","reply4":"мұғалім мен оқушының шығармашылық еңбегі;","subtheme":"Педагогика","correctly":"1","reply5":"оқыту формасы,","id_theme":"101","theme":"Методика преподавания","reply1":"оқытуды ұйымдастырудың негізгі формасы;","reply3":"мұғалім мен оқушының біріккен іс-әрекеті;"},{"reply3":"оқыту мен тәрбиенің ғылымилық принципі;","subtheme":"Педагогика","reply1":"мақсаттылық принципі;","question":"Оқыту мен тәрбие жұмыстарын белгілі мақсатпен ұйымдастыру мұғалім мен оқушылардың іс-әрекеттерінің үнемі жоспарлы түрде өтуіне игі әсер етеді::","reply5":"жүйелілік пен бірізділік принципі.","selected":"","id_theme":"101","reply2":"мектептің өмірмен байланыс принципі;","correctly":"1","reply4":"түсініктілік принципі;","theme":"Методика преподавания"},{"reply1":"тәрбие әдісі;","selected":"","reply2":"тәрбие тәсілі;","reply5":"тәрбие заңдылығы.","theme":"Методика преподавания","correctly":"1","reply4":"тәрбие принциптері;","reply3":"тәрбие құралы;","subtheme":"Педагогика","id_theme":"101","question":"Тәрбиеші  мен тәрбиеленушінің өзара байланыс іс-әрекеттерінде адамдық қасиеттерінің қалыптасуына бағытталған педагогикалық жұмыс тәсілдері не деп. аталады::"},{"theme":"Методика преподавания","subtheme":"Педагогика","selected":"","id_theme":"101","question":"Тәрбие әдісінің құрамды бөлігі:","reply2":"мақсат;","reply1":"тәсіл;","reply4":"құралы;","correctly":"1","reply3":"мазмұны;","reply5":"әңгіме."},{"question":"Бағалау:","reply1":"оқу жұмысының сапасы туралы мағлұмат алу;","correctly":"3","reply5":"оқушылардың алған білімі туралы хабар алу.","theme":"Методика преподавания","reply2":"педагогикалық басшылықтың және оқушылардың танымдық іс-әрекетін меңгерудің функциясы;","reply3":"оқушы  жұмысындағы дербестікті ,тапсырманы дұрыс орындау нәтижесін, білімнің ,іскерліктің ,дағдының сапасын анықтауды айтады;","id_theme":"101","reply4":"оқу бағдарламасының белгілі тарауын оқып болғаннан кейін БІД-ын тексеру;","selected":"","subtheme":"Педагогика"},{"reply2":"оқушылардың жазба, бақылау және графикалық жұмыстары т.б. зерттеу;","subtheme":"Педагогика","reply5":"жаңашыл мұғалімдердің  іс-тәжірибесімен танысу, насихаттау.","reply1":"нақты жағдайды есепке алып, педагогикалық процесті әдейі зерттейтін ғылыми тәжірибені ;","reply4":"құжаттармен терең жан-жақты танысу;","question":"Педагогикалық эксперимент:","id_theme":"101","correctly":"1","reply3":"мәліметтерді әңгіме әдісі арқылы толықтыру;","theme":"Методика преподавания","selected":""},{"reply4":"дайындық деңгейіне сай білім беру;","reply1":"оқушыға қысымшылық жасамай, ер кін қатысуына жағдай жасау;","selected":"","subtheme":"Педагогика","reply3":"оқушылар тарапынан білімді белсенді игеру;","question":"Ізгілендіру принципі дегеніміз:","correctly":"1","theme":"Методика преподавания","reply5":"әр түрлі көрнекіліктерді қолдану.","id_theme":"101","reply2":"оқу материалының баланың дайындық деңгейіне сай жүргізілуі;"},{"reply5":"тәрбиенің әдіс-тәсіл, формаларының бірлікте болуы.","reply3":"тәрбие процесінің қорытынды нәтижесі бүгінгі өмір талабына сай болуы;","selected":"","theme":"Методика преподавания","subtheme":"Педагогика","question":"Педагогикалық процес те оқушылардың дәлелді талап-тілектері мен мұқтаждықтарын имандылық, демократиялық принцип тер негізінде тәрбиелеу қай заңдылық:","correctly":"3","reply1":"жеке адам тәрбиесі мен дамуының бірлігі мен өзара байланыстылығы;","reply2":"тәрбие мен өзін-өзі тәрбиелеудің бірлігі;","id_theme":"101","reply4":"тәрбие процесінің қоғам өмірімен байланыстылығы;"},{"reply5":"балаға жоғары талап қою;","reply1":"адам бойындағы жақсылық нышандарына сүйсіну;","correctly":"4","id_theme":"101","theme":"Методика преподавания","subtheme":"Педагогика","reply3":"еңбек арқылы тәрбиелеу;","reply2":"өмір мен практиканың байланысты болуы;","question":"Тәрбие принципі дегеніміз:","reply4":"тәрбие процесін, ұйымдастырылуы мен әдістерін айқындайтын ережелер жиынтығы;","selected":""},{"correctly":"4","reply5":"оқу пәндерінің құрамын, әрбір пәнді оқытуға қажетті апта бойынша салат санын анықтайтын мемлекеттік құжат.","reply1":"мектептің іс-әрекетіне бағыт беретін құжат;","subtheme":"Педагогика","id_theme":"101","reply3":"білім, іскерлік, дағдының жиынтығы;","reply4":"дидактиканың талаптарына сай жасалған құрал;","question":"Оқулық:","selected":"","theme":"Методика преподавания","reply2":"белгілі пән бойынша меңгеретін білім, іскерлік, дағдының көлемін анықтайды:"},{"question":"Оқу бағдарламасы:","subtheme":"Педагогика","reply2":"белгілі пән бойынша меңгеретін білім, іскерлік, дағдының көлемін анықтайды:","reply3":"білім, іскерлік, дағдының жиынтығы;","reply5":"оқу пәндерінің құрамын, әрбір пәнді оқытуға қажетті апта бойынша салат санын анықтайтын мемлекеттік құжат.","theme":"Методика преподавания","reply4":"дидактиканың талаптарына сай жасалған құрал;","reply1":"мектептің іс-әрекетіне бағыт беретін құжат;","correctly":"2","id_theme":"101","selected":""},{"reply1":"1930ж;","theme":"Методика преподавания","reply4":"1936ж;","correctly":"1","id_theme":"101","question":"Нешінші жылдан бастап оқытуды ұйымдастырудың негізгі формасы сабақ болып енгізілді::","selected":"","reply5":"1946ж;","reply2":"1932ж;","reply3":"1935ж;","subtheme":"Педагогика"},{"selected":"","reply1":"оқушыларды білім, іскерлік,дағды жүйесімен қаруландыру;","reply4":"мадақтау мен жазалау;","correctly":"3","theme":"Методика преподавания","subtheme":"Педагогика","reply3":"оқытудағы қарама-қайшылық процесі;","reply2":"білімді игеру бағытындағы мұғалімнің және оқушының іс-әрекеттерінің жиынтығы,","reply5":"ата-ананың көмегі.","question":"Оқыту процесінің қозғаушы күші:","id_theme":"101"},{"subtheme":"Педагогика","reply5":"адам бойында борыш, ар-ұят, талғам, мәдениетті мінез-құлықтың адамгершілік қадір-қасиеттің үйлесімді дамуының қажеттілігін қамтиды.","reply4":"педагогикалық жұмыстың же місті болуының ең басты шарттарының бірі-тәрбиенің анық,айқын мақсатының болуы;","question":"Жеке адамға талап қоюшылық пен  баланы құрметтей білудің бірлікте болу принципі:","reply2":"адамгершілікке жатпайтын іс-әрекеттермен қарсы күресу дағдысын қалыптастырады, тәрбие жұмысында формализм болмауына ықпал жасайды;","theme":"Методика преподавания","reply1":"балаға жоғары талап қою, оның күш-жігері мен қабілеті, еркіне сенім көрсетумен ұштасуы керек;","selected":"","reply3":"адамды тек материалдық-рухани байлықтарды жасаушы  ғана емес, оны азамат ретінде көрінетін жеке тұлға етіп қалыптастыру:","correctly":"1","id_theme":"101"},{"id_theme":"101","subtheme":"Педагогика","selected":"","reply3":"микроорта;","reply1":"табиғи орта;","reply5":"мезоорта,","theme":"Методика преподавания","question":"Жеке адамның мінез-құлқының дамуына ықпал жасайтын қоғамдағы әлеуметтік қатынас, қандай орта деп. аталады:","correctly":"2","reply2":"әлеуметтік орта;","reply4":"макроорта;"},{"question":"Оқыту принципі дегеніміз:","subtheme":"Педагогика","reply2":"білім беру жүйесі;","correctly":"1","reply5":"тәрбие процес інде басшылыққа алынатын ережелер мен қағидалар жиынтығы.","reply3":"оқытудың заңдылықтары;","id_theme":"101","reply4":"оқыту әдістерінің жүйесі;","theme":"Методика преподавания","reply1":"оқытудың мазмұнын ашатын ережелер мен қағидалар жиынтығы;","selected":""},{"question":"Оқу-тәрбие процесінің сандық және сапалық көрсеткішін анықтау:","correctly":"3","reply3":"математикалық-кибернетикалық әдіс;","reply5":"бақылау.","reply1":"тест;","reply4":"сұхбаттасу;","theme":"Методика преподавания","reply2":"педагогикалық озат тәжірибені модельдеу;","subtheme":"Педагогика","id_theme":"101","selected":""},{"theme":"Методика преподавания","correctly":"5","reply1":"адамгершілік, тәртіп нормаларын білу;","subtheme":"Педагогика","reply4":"өзінің азаматтық құқықтарымен міндеттерін мегеру;","reply5":"жеке тұлғаның мінез-құлықтарының, әдет-дағдысының, білімдерінің ережелерімен талаптарына және оларды қадағалауға айналған моральдық нормалар.","selected":"","id_theme":"101","reply3":"діни сенімдердің әдет-ғұрыптардың негізінде сапалардың қалыптасуы;","question":"Адамгершілік тәрбиесі дегеніміз:","reply2":"кез келген жағдайда дұрыс тәртіп нормаларының қалыптасуы;"}],"num_questions":30,"results":{"101":{"theme":"Методика преподавания","quest_count":30,"score":0,"porog":15}},"test_type":"type-block","remain_time":7200};
    let q = function(question) {
        let res = $('<div/>');
        let txt = $('<h1/>');
        txt.html(question['question']);
        res.append(txt);
        let correct = question['correctly'];
        let ans = $('<p/>');
        ans.append("<p>Correct: " + question['reply' + correct]+"</p>");
        for (let i = 1; i <= 5; ++i) {
            ans.append("<p>Variant " + i + ": " + question['reply' + i]+"</p>");
        }
        res.append(ans);
        return res;
    };
    for (elem in testobj2['questions']) {
        $('.root').append(q(testobj2['questions'][elem]));
        console.log(elem);
    }
    for (elem in testobj['questions']) {
        $('.root').append(q(testobj['questions'][elem]));
        console.log(elem);
    }
});
